{
  "nav": {
    "Sobre Mim": "Sobre Mim",
    "Tecnologias": "Tecnologias",
    "Projetos": "Projetos",
    "Serviços": "Serviços",
    "Contate-Me": "Contate-Me"
  },

  "apresentacao": {
    "descricao": "Sou um desenvolvedor Full Stack apaixonado por criar soluções mobile, focando em aplicações robustas, escaláveis e intuitivas. Meu objetivo é transformar ideias em experiências digitais impactantes, sempre buscando unir design, funcionalidade e inovação.",
    "baixarcurriculo": "Baixar Currículo",
    "saopaulobrasil": "São Paulo, Brasil.",
    "disponIvelparaprojetos": "Disponível para projetos."
  },

  "WelcomeTopic": {
    "titulo": "Sobre mim",
    "sub-titulo": "Quer saber mais sobre mim ?",
    "descricao": "Sou movido pela curiosidade e pelo desejo constante de aprender. Atualmente, estou ampliando minhas habilidades com Flutter, explorando o desenvolvimento multiplataforma para criar soluções ainda mais versáteis. Com experiência em front-end e back-end, dedico-me a desenvolver projetos que conectam pessoas, resolvem problemas reais e promovem impactos positivos através da tecnologia."
  },

  "Skills": {
    "titulo": "Tecnologias"
  },

  "Projects": {
    "titulo": "Projetos",
    "sub-titulo": "Alguns dos projetos que construí:",
    "fittrack": {
      "descricao": "FitTrack é um aplicativo móvel desenvolvido para facilitar o gerenciamento integrado de treinos e alimentação, ajudando os usuários a definirem metas de saúde e bem-estar. A plataforma oferece uma solução completa ao acompanhar tanto o progresso físico quanto a dieta em um único lugar."
    },
    "vitalhub": {
      "descricao": "O VitalHub é uma plataforma móvel que simplifica a interação entre médicos e pacientes, centralizando agendamentos, consultas e comunicação. A solução permite o agendamento eficiente de consultas, visualização de trajetos até a clínica via GPS e contato direto com os médicos, otimizando a experiência de ambos e eliminando a fragmentação no processo."
    },
    "eventplus": {
      "descricao": "O Event Plus é uma aplicação web intuitiva e robusta voltada para o gerenciamento completo de eventos de instituições. A plataforma permite o planejamento, organização e gerenciamento de eventos de forma eficaz, otimizando o processo desde a criação até a finalização."
    },
    "techconnect": {
      "descricao": "O Tech Connect é uma rede social que une entusiastas da tecnologia em um espaço digital colaborativo. A plataforma facilita o compartilhamento de conhecimento, networking e desenvolvimento de projetos, conectando desenvolvedores e inovadores. Com um ambiente inclusivo, o Tech Connect promove o aprendizado contínuo e o avanço tecnológico."
    },
    "checkpoint": {
      "descricao": "O Projeto Checkpoint é um sistema web que automatiza a gestão de estágios, substituindo processos manuais por uma solução eficiente e gamificada. Oferece funcionalidades como controle de frequência via login e logout, geração de relatórios em PDF e justificativas automáticas de ausência, promovendo organização e engajamento"
    }
  },

  "Services": {
    "titulo": "Serviços",
    "sub-titulo": "O que posso fazer por você:",
    "mobile": {
      "titulo": "Desenvolvimento de Aplicativos Móveis",
      "descricao": "Desenvolvo aplicativos para Android e iOS utilizando React Native, com interfaces modernas e funcionalidades eficientes."
    },
    "web": {
      "titulo": "Criação de Sites",
      "descricao": "Transformo suas ideias em um site profissional e atrativo, focado em transmitir sua mensagem de forma clara e eficaz."
    },
    "backend": {
      "titulo": "Desenvolvimento de APIs e Back-end",
      "descricao": "Crio APIs robustas e escaláveis utilizando C#, integradas com bancos de dados como SQL Server e MongoDB."
    },
    "cloud": {
      "titulo": "Integração e Automação com Microsoft Azure",
      "descricao": "Implemento soluções na nuvem, configurando pipelines de CI/CD com Azure DevOps, além de automação de infraestrutura e serviços."
    },
    "performance": {
      "titulo": "Otimização de Performance Web",
      "descricao": "Melhoro o desempenho de sites e aplicativos, garantindo uma navegação rápida e eficiente, otimizando para SEO e acessibilidade."
    },
    "design": {
      "titulo": "Design de Interfaces Responsivas",
      "descricao": "Crio interfaces intuitivas e responsivas com React, Next.js e Tailwind CSS, que se adaptam perfeitamente a qualquer dispositivo."
    },
    "devops": {
      "titulo": "Soluções de DevOps",
      "descricao": "Configuro pipelines de desenvolvimento contínuo com Git e Azure DevOps, facilitando a integração de novos recursos com segurança."
    },
    "project_management": {
      "titulo": "Gerenciamento de Projetos",
      "descricao": "Gerencio projetos de software utilizando Trello e metodologias ágeis, garantindo organização e prazos cumpridos."
    },
    "database": {
      "titulo": "Integração de Banco de Dados",
      "descricao": "Realizo a integração e otimização de bancos de dados relacionais e não-relacionais, como SQL Server e MongoDB, para armazenamento eficiente de dados."
    },
    "fullstack": {
      "titulo": "Desenvolvimento Full-Stack",
      "descricao": "Crio aplicações completas, desde o front-end até o back-end, utilizando tecnologias como React, C#, MongoDB, e SQL Server."
    },
    "support": {
      "titulo": "Manutenção e Suporte Técnico",
      "descricao": "Ofereço suporte contínuo para garantir que seus sistemas e aplicativos funcionem de maneira estável e segura."
    }
  },

  "Contact": {
    "titulo": "Contate-me",
    "sub-titulo": "O que vem a seguir? Sinta-se à vontade para entrar em contato comigo se estiver procurando um desenvolvedor ou tiver alguma dúvida.",
    "descricao": "Você pode me encontrar nessas plataformas:"
  }
}
